===== No violations with type arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should have any attributes with argument "AttributeNamespace.TypeArgument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments passed
Message: 
All Evaluations passed

----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should be Types that have any attributes with argument "AttributeNamespace.TypeArgument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments passed
Message: 
All Evaluations passed

===== No violations with value arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should have any attributes with argument "1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments passed
Message: 
All Evaluations passed

----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should be Types that have any attributes with argument "1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments passed
Message: 
All Evaluations passed

===== Violations with type arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should have any attributes with argument "AttributeNamespace.UnusedTypeArgument"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments does only have attribute AttributeNamespace.Attribute1 with arguments "Argument1" and "1" and "AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should have any attributes with argument "AttributeNamespace.UnusedTypeArgument"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithArguments does only have attribute AttributeNamespace.Attribute1 with arguments "Argument1" and "1" and "AttributeNamespace.TypeArgument1"



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should be Types that have any attributes with argument "AttributeNamespace.UnusedTypeArgument"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments is not Types that have any attributes with argument "AttributeNamespace.UnusedTypeArgument"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should be Types that have any attributes with argument "AttributeNamespace.UnusedTypeArgument"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithArguments is not Types that have any attributes with argument "AttributeNamespace.UnusedTypeArgument"



===== Violations with value arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithoutAttributes" should have any attributes with argument "1"
Result: False
Description: AttributeNamespace.ClassWithoutAttributes does not have any attributes
Message: 
"Types that are "AttributeNamespace.ClassWithoutAttributes" should have any attributes with argument "1"" failed:
	AttributeNamespace.ClassWithoutAttributes does not have any attributes



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithoutAttributes" should be Types that have any attributes with argument "1"
Result: False
Description: AttributeNamespace.ClassWithoutAttributes is not Types that have any attributes with argument "1"
Message: 
"Types that are "AttributeNamespace.ClassWithoutAttributes" should be Types that have any attributes with argument "1"" failed:
	AttributeNamespace.ClassWithoutAttributes is not Types that have any attributes with argument "1"



===== Empty arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithoutAttributes" should have any attributes
Result: False
Description: AttributeNamespace.ClassWithoutAttributes does not have any attributes
Message: 
"Types that are "AttributeNamespace.ClassWithoutAttributes" should have any attributes" failed:
	AttributeNamespace.ClassWithoutAttributes does not have any attributes



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithoutAttributes" should be Types that have any attributes
Result: False
Description: AttributeNamespace.ClassWithoutAttributes is not Types that have any attributes
Message: 
"Types that are "AttributeNamespace.ClassWithoutAttributes" should be Types that have any attributes" failed:
	AttributeNamespace.ClassWithoutAttributes is not Types that have any attributes



===== Multiple arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should have any attributes with arguments "42" and "NotTheValueOfAnyAttribute"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments does only have attribute AttributeNamespace.Attribute1 with arguments "Argument1" and "1" and "AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should have any attributes with arguments "42" and "NotTheValueOfAnyAttribute"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithArguments does only have attribute AttributeNamespace.Attribute1 with arguments "Argument1" and "1" and "AttributeNamespace.TypeArgument1"



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should be Types that have any attributes with arguments "42" and "NotTheValueOfAnyAttribute"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments is not Types that have any attributes with arguments "42" and "NotTheValueOfAnyAttribute"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" should be Types that have any attributes with arguments "42" and "NotTheValueOfAnyAttribute"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithArguments is not Types that have any attributes with arguments "42" and "NotTheValueOfAnyAttribute"



===== Multiple inputs =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" or "AttributeNamespace.ClassWithTwoAttributesWithArguments" should have any attributes with argument "Argument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments passed
Result: True
Description: AttributeNamespace.ClassWithTwoAttributesWithArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" or "AttributeNamespace.ClassWithTwoAttributesWithArguments" should have any attributes with argument "2"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments does only have attribute AttributeNamespace.Attribute1 with arguments "Argument1" and "1" and "AttributeNamespace.TypeArgument1"
Result: True
Description: AttributeNamespace.ClassWithTwoAttributesWithArguments passed
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" or "AttributeNamespace.ClassWithTwoAttributesWithArguments" should have any attributes with argument "2"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithArguments does only have attribute AttributeNamespace.Attribute1 with arguments "Argument1" and "1" and "AttributeNamespace.TypeArgument1"



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" or "AttributeNamespace.ClassWithTwoAttributesWithArguments" should be Types that have any attributes with argument "Argument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments passed
Result: True
Description: AttributeNamespace.ClassWithTwoAttributesWithArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" or "AttributeNamespace.ClassWithTwoAttributesWithArguments" should be Types that have any attributes with argument "2"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithArguments is not Types that have any attributes with argument "2"
Result: True
Description: AttributeNamespace.ClassWithTwoAttributesWithArguments passed
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithArguments" or "AttributeNamespace.ClassWithTwoAttributesWithArguments" should be Types that have any attributes with argument "2"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithArguments is not Types that have any attributes with argument "2"



