===== No violations with type arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "InvalidName=AttributeNamespace.TypeArgument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "InvalidName=AttributeNamespace.TypeArgument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.UnusedTypeArgument"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.UnusedTypeArgument"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "InvalidName=AttributeNamespace.TypeArgument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "InvalidName=AttributeNamespace.TypeArgument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.UnusedTypeArgument"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.UnusedTypeArgument"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

===== No violations with value arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "InvalidName=Argument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "InvalidName=Argument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter2=NotTheValueOfAnyAttribute"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter2=NotTheValueOfAnyAttribute"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "InvalidName=Argument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "InvalidName=Argument1"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter2=NotTheValueOfAnyAttribute"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter2=NotTheValueOfAnyAttribute"
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

===== Violations with type arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



===== Violations with value arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter2=Argument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named argument "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter2=Argument1"



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter2=Argument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter2=Argument1"



===== Empty arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with any of no named arguments (always true)
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with any of no named arguments (always true)
Result: True
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments passed
Message: 
All Evaluations passed

===== Multiple arguments =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" should be Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named arguments "NamedParameter1=AttributeNamespace.TypeArgument1" and "NamedParameter2=Argument1"



===== Multiple inputs =====

----- Conditions -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithTwoAttributesWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
	AttributeNamespace.ClassWithTwoAttributesWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithTwoAttributesWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
	AttributeNamespace.ClassWithTwoAttributesWithNamedArguments does have attribute AttributeNamespace.Attribute1 with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



----- Predicates -----

Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithTwoAttributesWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
	AttributeNamespace.ClassWithTwoAttributesWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



Query: Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Result: False
Description: AttributeNamespace.ClassWithTwoAttributesWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
Message: 
"Types that are "AttributeNamespace.ClassWithSingleAttributeWithNamedArguments" or "AttributeNamespace.ClassWithTwoAttributesWithNamedArguments" should be Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"" failed:
	AttributeNamespace.ClassWithSingleAttributeWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"
	AttributeNamespace.ClassWithTwoAttributesWithNamedArguments is not Types that do not have any attributes with named argument "NamedParameter1=AttributeNamespace.TypeArgument1"



